IDEA Open Model
CssEffectType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Type of effects in cross-section component
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum CssEffectType
Public Enumeration CssEffectType
Members
Member name | Value | Description
InternalForce | 0 |  internal forces
DeformationPlane | 1 |  deformation plane
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace